export type WordPack = {
  id: string;
  name: string;
  vocabulary: string[];
  patterns: string[];
};

export const wordPacks: WordPack[] = [
  {
    id: "iitomo2-ch1",
    name: "iitomo2 Ch1",
    vocabulary: ["すみません","いま","まい日","はやく","(お)ふろ","ぶかつ","しゅくだい","あびます","おきます","おわります","かえります","ねます","のみます","はいります","うち","学校","コンビニ","(お)てん","(お)ちゃ","ヨーグルト","カレーライス","(あさ)ごはん","(お)べんとう","ばんごはん","(お)ひるごはん","きゅうしょく" ],
    patterns: ["何時","〜時","〜半","〜分","[person]の一日","わたしたちの一日" ],
  },
  {
    id: "iitomo2-ch2",
    name: "iitomo2 Ch2",
    vocabulary: ["小学校","中学校","高校","大学","(お)ひるやすみ","きょう","そうじ","つまらない","にがて(な)","むずかしい","かもく","えいご","こくご","すう学","おんがく","りか","たいいく","ぎじゅつ","かてい","どうとく","れきし","ちり","自己紹介" ],
    patterns: ["何年生","[number]年生","[number]時かんめ","何時かんめ","〜じゃないです","から","まで","何時から","何時まで","そうじ(を)します","好きなかもく","にがてなかもく","いちばん好きなかもく","いちばんむずかしいかもく","〜でした","ほんとうですか" ],
  },
  {
    id: "iitomo2-ch3",
    name: "iitomo2 Ch3",
    vocabulary: ["はる（春）","なつ（夏）","あき（秋）","ふゆ（冬）","一がつ","二がつ","三がつ","にゅう学しき","えんそく","水えいたいかい","やすみ","はるやすみ","なつやすみ","ふゆやすみ","りんぎょうさい","ぶんかさい","しゅう学りょこう","ミュージカル","えんげき","ひこうき","くるま","じてんしゃ","しんかんせん","スクールバス","タクシー","でんしゃ","バス","あるいて" ],
    patterns: ["あるいて行きます","いつ","何月","何曜日","何で","きてください","たべてください","みてください" ],
  },
  {
    id: "iitomo2-ch4",
    name: "iitomo2 Ch4",
    vocabulary: ["しゅみ","りょうり","どくしょ","つり","つくります","ひきます","(で)あそびます","しゃしんをとります","かきます","つかいます","さんぽします","うたいます","へや","うみ","ビーチ","山","川","あした","あさ","きょ年","天気","くもり","たくさん" ],
    patterns: ["[person]にあいます","[vehicle]にのります","うちにいます","[place]にいます","[place]にいてください","といっていない","ひまな時に","しゅうまつに","休みに","いつも","たいてい","よく","時々","あまり〜ません","ぜんぜん〜ません","[verb]ました","[verb]ませんでした","どう","どうでしたか","よかったです","おいしかったです","いいですね" ],
  },
  {
    id: "iitomo2-ch5",
    name: "iitomo2 Ch5",
    vocabulary: ["あし","あたま","かお","かみ(の毛)","くち","しっぽ","せ","手","はな","耳","目","ながい","みじかい","たかい","ひくい","つよい","すてき(な)","へん(な)","いろいろ(な)","アニメ","キャラクター","コスプレ","ふく","サービス","先しゅう","まい年","きます","できます" ],
    patterns: ["どんな","どの","どっち","どちら","どれ","どうして","せがたかい","せがひくい","それに","この","ここ","じょうずに","にんきがあります" ],
  },
  {
    id: "iitomo2-ch6",
    name: "iitomo2 Ch6",
    vocabulary: ["おとこの人","おんなの人","パーティー","プレゼント","ギフトカード","カラオケ","よる","めずらしい","わたあめ","たこやき","とうもろこし","やきそば","きもの","ゆかた","はっぴ","おめん","はなび","つめたい","たいせつ(な)","もっと","また" ],
    patterns: ["みんなで","全員","かぞくみんなで","もらいます","(お)いわいします","おいしかったです","おもしろかったです","たのしかったです","こんでいました","えんそうします","おなかがいっぱい","きをつけてね","げんきですね","あけてもいいですか" ],
  }
];
